---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaLoad
source: html/5dc205a9-cafd-911b-6a56-26f2e8bfcdc1.htm
---
# Autodesk.Revit.DB.Structure.AreaLoad

An object that represents a force applied across an area.

## Syntax (C#)
```csharp
public class AreaLoad : LoadBase
```